import React from 'react';

const Reactwork = () => {
    return (
        <div className='container mt-5 shadow rounded p-3'>
            <h4> How React Work?(রিঅ্যাক্ট কিভাবে কাজ করে ?) </h4>
            <h5>Ans:</h5>
            
        <p>রিঅ্যাক্ট সাধারণত ইউজার ইন্টারফেস বানাতে ইউজ করা হয়। এটা জাভাস্ক্রিপ্ট এর অনেক হট একটা লাইব্রেরী। সহজেই ইউজার ইন্টারফেজ বানানো, পেজে যেকোনো ধরনের পরিবর্তন সহজেই, কম সময়ের মধ্যে করানো, ডাটা একজায়গা থেকে আরেকজায়গায় ফ্লো করানো, এগুলো সবকিছুতেই রিঅ্যাক্ট এক্সপার্ট। রিঅ্যাক্ট  ব্রাউজারের ডমের মতো করে সেইম টু সেইম আরেকটা ডম তৈরী করে যেটাকে ভার্চুয়াল ডম বলা হয়। এখন এই ডম দেখতে পুরো সেই আসল ডমের মতোই, কিন্তু এই ভার্চুয়াল ডমটা আসলে একটা জাভাস্ক্রিপ্ট অবজেক্ট। রিঅ্যাক্ট এটাকে এমনভাবে তৈরী করে যে এই ডমের সাথে সহজেই জাভাস্ক্রিপ্ট ইউজ করে যেকোনো ইলিমেন্ট মডিফাই করা যায় কম সময়ের মধ্যে এবং এফিসিয়েন্টলি।</p>
        </div>
    );
};

export default Reactwork;